tutorials/incompressible/pimpleRemeshFoam/simple_0012/mapFieldsTesting/0/gammaInt
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      gammaInt;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   uniform 1;

boundaryField
{
    airfoil
    {
        type            zeroGradient;
    }
    freestream
    {
        type            fixedValue;
        value           uniform 1;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
